[
    {
        "image": "689351.jpg",
        "label_type": "i",
        "text": "Plants of North East Greenland E.6 Collected on the British Arcturus Expedition to Krumme Langsø, Ole Rømers Land. 2004 Ranunculus pedatifidus Sm. On slope below \"cave\" above north side of Krumme Langsø Lat. 74° 02' N. Long. 23° 36' W. Alt. 250m. 21.7.04 Leg. R.W.M.Corner"
    },
    {
        "image": "704605.jpg",
        "label_type": "i",
        "text": "Vascular Plants of North East Greenland E.6 Collected on the British Arcturus Expedition to Southern Dove Bay. 2006. Potentilla hookeriana Lehm. Dry slope on south side of Ravnedalen, Rechnitzers Land. Lat. 76° 19.5' N. Long. 21° 42' W. alt. 50m. 12.8.06. Leg. R.W.M.Corner"
    },
    {
        "image": "859622.jpg",
        "label_type": "i",
        "text": [
            "Vascular Plants of North East Greenland E.6 Collected on the British Arcturus Expedition to Southern Dove Bay. 2006. Eriophorum callitrix Cham. In Eriophorum/Carex saxatilis mire Fangersund camp, Adolph S. Jensens Land. Lat. 76° 16' N. Long. 21° 27.5' W. alt. 20m. 13.8.06. Leg. R.W.M. Corner."
        ]
    },
    {
        "image": "861422.jpg",
        "label_type": "i",
        "text": [
            "Vascular Plants of North East Greenland E.6 Collected on the British Arcturus Expedition to Southern Dove Bay. 2006. Carex supina Wbg. ssp. spaniocarpa. (Steud.) Hult. Dry stony moraine, south side of Ravnedalen, Rechnitzers Land near entrance. Lat. 76° 19.5' N. Long. 21° 42'. alt. 5Om. 8.8.06. Leg. R.W.M. Corner."
        ]
    },
    {
        "image": "861423.jpg",
        "label_type": "i",
        "text": [
            "Vascular Plants of North East Greenland E.6 Collected on the British Arcturus Expedition to Southern Dove Bay. 2006. Carex supina Wbg. ssp. spaniocarpa (Steud.) Hult. Dry slopes near Fangersund camp, Adolph S. Jensens Land. Lat. 76° 19' N. Long 21° 27.5' W. alt. 3Om. 13.8.06. Leg. R.W.M. Corner."
        ]
    },
    {
        "image": "861918.jpg",
        "label_type": "i",
        "text": [
            "Vascular Plants of North East Greenland E.6 Collected on the British Arcturus Expedition to Southern Dove Bay. 2006. Carex stans Drej. Mire above Majhytten hut, Syttendemajfjorden, Adolph S. Jensens Land. Lat. 76° 17' N. Long. 21° 06' W. alt. 30m. 18.8.06. Leg. R.W.M.Corner."
        ]
    }
]